{
    "0": "Correct room to return the gateway <p>Hi, I&#39;m wondering if this is the correct place to return the gateway?</p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=paste%2Fky7yf4kejiayz%2F5915de890feef2d0c5e63d0df8a9bf94288bb0afd4be04a52321c2014dec95e0%2F2302af54634af427a94e47a9f260ece.jpg\" alt=\"2302af54634af427a94e47a9f260ece.jpgNaN\" height=\"480\" /><br />Or if I want to return the gateway to the University, where do I go to?<br />Much appreciated!</p> The building should be PHE, but Professor Goodney seems not in his office this morning. You can try to return to CS front desk at SAL. But for returning at SAL, you may need to contact Professor Goodney first.",
    "1": "How to submit the final project materials <p>For submitting the final project materials?</p>\n<p>for the node-red, can we export the entire flow in json format?</p>\n<p>for the AWS lambda function I think we can copy them to a py file, but what about the other AWS components such as the API Gateway and the DynamoDB setup? I am not sure how should we explain them in the readme file</p> <md>Please put as much as you can in your slides and video. Taking screenshots is enough.</md>",
    "2": "How to make I2C sensors work in dot-example? <p>It&#39;s been days that I&#39;m trying to integrate our BME280 sensor (the I2C version) with Dot-example application. I have BME280 library imported to that app, and I have confirmed that it works when I implement it in a separate app (that doesn&#39;t involve sending data with Lora). However, when I use the exact same code in Dot-example, it always outputs numbers that doesn&#39;t make sense. The reading doesn&#39;t change at all.<br /><br />I&#39;m using this BME280 library: <a href=\"https://os.mbed.com/users/MACRUM/code/BME280/rev/bce5ac62b015/\" target=\"_blank\" rel=\"noopener noreferrer\">https://os.mbed.com/users/MACRUM/code/BME280/rev/bce5ac62b015/</a><br />The implementation is basically:</p>\n<p></p>\n<p>DigitalOut vcc(GPIO2); // my vcc is connected to this one</p>\n<div style=\"font-weight:normal\">\n<div>I2C i2c(I2C_SDA, I2C_SCL);</div>\n</div>\n<p>BME280 sensor(i2c);</p>\n<p>// xdot setup code</p>\n<p></p>\n<p>while(1):</p>\n<div style=\"font-weight:normal\">\n<div>vcc = 1;</div>\n<div>sensor.initialize();</div>\nfloat humidity = sensor.getHumidity();\n<div>float temperature = sensor.getTemperature();</div>\n<div>printf(&#34;\\n\\n%.2f\\n%.2f\\n\\n&#34;, humidity, temperature); // logging for debugging</div>\n<div>// preparing the msg to be sent</div>\n<div>send_data(tx_data);</div>\n</div> <md>That's probably because the sda/scl pins for your I2C are already used somewhere else in dot-examples. You have to find them out and comment out those parts. This happened in other teams and please double check.</md>",
    "3": "communication between xDot and Raspberry pi using UART <p>Dear Yude,</p>\n<p></p>\n<p>Our group encountered a problem when we establish UART communication between xDot and Raspberry pi, even we used the inverter. </p>\n<ul><li>Loopback tests are successfully on both side</li><li>xDot can send message to Raspberry pi successfully</li><li>Raspberry pi can&#39;t send message to xDot but pi received the message sent by itself even tx of pi is connected with rx of xDot and rx of pi connected with tx of xDot(that&#39;s wierd)</li></ul>\n<p>We tried to provide power to inverter from xDot and raspberry pi, but the inverter seems not work normally even we tried several inverters. Should we use an independent power supply for inverter? </p> solved by sharing same GND <md>Of course you need to do that.</md>",
    "4": "Returning Gateway For returning the gateway, the professor said that we can drop it to another professor&#39;s office. May I ask where and when we can return the gateway? <md>Please send an email to the proefessor to ask about it.</md>",
    "5": "Two Consecutive HTTP requests in a flow lead to second flow timeout <p>For the node red, I set up two http request to aws triggered by timestamp. When they are not running consecutively, each http request is working fine. However, when I connect them together, the second one always timeout.</p>\n<p>May I ask how to solve this problem? </p> <md>Are you sending the get requests? You may add some id to differenciate the requests from different threads if so. Also, you may need two threads on the server side.</md>",
    "6": "can we use Raspberry Pi or Microcontroller for final project <p>Dear professor and TAs,</p>\n<p></p>\n<p> I just ask for curious, why we should use xDot rather than Raspberry Pi or Microcontroller for final project? Thank you.</p> One of the reason is that xDot costs extremely low energy in the long distance( like 10km) wireless transmission. <md>LoRa is a hot topic in academia. You may want to sit in EE550 to learn more about it next semester if you are interested in it.</md>",
    "7": "Presentation <p>Good evening!</p>\n<p></p>\n<ul><li>will we have practice presentation next week?</li><li>How much time will the final presentation be?</li></ul> <md>Hi, please ask the professor about it. He would talk about this in detail last year during lectures.</md>",
    "8": "Gateway Node-RED &#34;ENOENT, no such file or directory&#34; for AWS IoT certification file <md>Hi, has anyone encountered this kind of issue when sending data to AWS IoT Core via Node-RED on Gateway?\n![image.png](/redirect/s3?bucket=uploads&prefix=paste%2Fl7dlqs1firl1vh%2Fee8436231d406b4e8046d667933632720f98ab51b05078a61b415c82466efa1c%2Fimage.png)\n\n![image.png](/redirect/s3?bucket=uploads&prefix=paste%2Fl7dlqs1firl1vh%2F2b5160de83665e636955cf79c59e0b48f3f1952405e99f71bf47cbabec6ea048%2Fimage.png)\n\nThe http request node in Node-RED cannot read my TLS certification files which I downloaded from AWS. I'm sure they exist in this path, but it just cannot read in. (I've tried changing the slash to '/' or '\\\\\\\\')\n\nThanks for any help.</md> <md>You are able to ssh to the Gateway (where the NodeRed is running) from your laptop. Upload the certicicates to the Gateway and put the paths of the certificates uploaded to the Gateway instead.</md>",
    "9": "AT Firmware Stuck at Bootloader <md>Hey everyone!\n\nI have tried compiling the Dot-AT-Firmware as well as flashing the prebuilt firmware hinted at @108, but my xDot seems to be stuck at the bootloader\n\n```\n[INFO] MultiTech Bootloader 1.1.0\n```\n\nHas anyone else seen something similar? What would be a potential way to fix this?</md> <md>Are you using a correct baud rate, say 115200bps? and It may be still stuck if so somehow...just type the correct command and it will execute it. It may be just a display issue.</md>",
    "10": "Problem choosing the right RSMA-to-U.FL Coaxial Cable. We&#39;re using the default antenna mentioned in the xDot Developer Guide: <a href=\"https://www.digikey.com/en/products/detail/pulse-electronics/W1063/1634416\" target=\"_blank\" rel=\"noopener noreferrer\">W1063 Pulse Electronics</a><br />The default RSMA-to-U.FL Coaxial Cable mentioned in the <a href=\"https://www.multitech.com/documents/publications/developer-guides/S000645--xDOT-Developer-Guide.pdf\">xDot Developer Guide</a>, the <a href=\"https://www.digikey.com/en/products/detail/multi-tech-systems-inc/CARSMA-UFL-1/7776637\" target=\"_blank\" rel=\"noopener noreferrer\">CARSMA-UFL-1</a>, is no longer manufactured and not available.<br />I&#39;m wondering if any RSMA-to-U.FL Coaxial Cable will work? The size and type of the port is rarely mentioned anywhere. <br />I&#39;m currently looking at the <a href=\"https://www.digikey.com/en/products/detail/microchip-technology/RN-UFL-SMA6/2094296\" target=\"_blank\" rel=\"noopener noreferrer\">RN-UFL-SMA6 Microchip Technology</a>, which is described as a RP-SMA Jack male to U.FL (UMCC) Plug female cable.<br />I&#39;m wondering if this is the correct type of cable? <md>are using choosing an antenna for your xdot or gateway? Either can be found on amazon. But they are not necessary.</md>",
    "11": "Unable to connect to Node-RED <md>I have successfully installed Node-RED as a custom app on Gateway. However, I cannot reach port 1880 (port of Node-RED) on Gateway. I have been refreshing and waiting for half an hour. \n\n![IMG_6902.PNG](/redirect/s3?bucket=uploads&prefix=paste%2Fl7dlqs1firl1vh%2Feacf41e9ad8e0d0833d3ad30bbc4e354a02452bb532be43e7eab66aa66486b4a%2FIMG_6902.PNG)\n\nDid anyone meet the same issue?\n\nThank you fro your reply.</md> You might need to enable Node-red Setting Via LAN under Administration-&gt;Access Configuration.",
    "12": "Dot-AT-Firmware Build Error <p>After we imported the Dot-AT-Firmware project, added the library to the project, and started to build the project, we encountered this problem:</p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=paste%2Fl7dlquwqoo2203%2F02dc27e875da788fa71ace065bc395e502a56193ab54170255821dbd3cd2048e%2Fimage.png\" alt=\"image.pngNaN\" /></p>\n<p>We have checked the mbed_app.json file and are not sure how we can address this problem. Could anyone help with this problem?</p>\n<p>Thanks for your help.</p> <p>Hi, we met this same problem as you mentioned. We solved it by doing the following:</p>\n<p>In step 14 of the instruction, when adding the library, use version 4.2.1 instead of choosing the master branch, because the master branch keeps changing.</p> <md>Nice try! We are just required to use the compiled AT firmware to do the lab, but it's a good experience to try to compile it by yourself.</md>",
    "13": "Node-red Installation Issue <p>When we were trying to find Node-red in Apps inside the Multitech UI, there was nothing in it, it shows as below.</p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=paste%2Fl785aozm6u5iv%2F797e35233df2c27caf3700b7d859b93ed413c3bc3ce3a14707fa3c542c4b9335%2Fimage.png\" alt=\"image.pngNaN\" width=\"447\" height=\"200\" /></p>\n<p>Therefore, we tried all the versions provided by Multitech, but all of these versions do not include Node-red App.</p>\n<p><img src=\"/redirect/s3?bucket=uploads&amp;prefix=paste%2Fl785aozm6u5iv%2Fc130655b1c912dbb3f29d19f3086169551dda172c2782ca3ce0a631be98abd07%2Fimage.png\" alt=\"image.png\" width=\"441\" height=\"208\" /></p>\n<p>Does that mean we need to install the custom app manually? If it does, we also tried to SSH into the gateway and use the command line to install Nodejs and Node-red, unfortunately, there are more problems like DNS not working even if we config the DNS to include nameserver 8.8.8.8 nameserver 8.8.4.4 nameserver 127.0.0.1.</p>\n<p>Thank you for your help.</p> "
}